
# tap repositories and their packages

tap 'homebrew/core'
brew 'docbook'
brew 'docbook-xsl'
brew 'freetype'
brew 'gdbm'
brew 'gettext'
brew 'ghostscript'
brew 'git'
brew 'glib'
brew 'gnu-getopt'
brew 'htop'
brew 'ilmbase'
brew 'imagemagick'
brew 'jpeg'
brew 'libde265'
brew 'libffi'
brew 'libheif'
brew 'liblqr'
brew 'libomp'
brew 'libpng'
brew 'libtiff'
brew 'libtool'
brew 'little-cms2'
brew 'mas'
brew 'ncurses'
brew 'neofetch'
brew 'openexr'
brew 'openjpeg'
brew 'openssl@1.1'
brew 'pcre'
brew 'pcre2'
brew 'python'
brew 'python@3.8'
brew 'readline'
brew 'screenresolution'
brew 'shared-mime-info'
brew 'sqlite'
brew 'webp'
brew 'x265'
brew 'xmlto'
brew 'xz'

tap 'homebrew/bundle'

tap 'homebrew/cask-drivers'

tap 'homebrew/cask-fonts'
cask 'font-inconsolata'

tap 'homebrew/cask-versions'

tap 'homebrew/services'

tap 'homebrew/cask'
cask 'libreoffice'

tap 'rcmdnk/file'
brew 'brew-file'

# App Store applications
mas 'Affinity Designer (1.8.3)', id: 824171161
mas 'Affinity Photo (1.8.3)', id: 824183456
mas 'Xcode (11.5)', id: 497799835
